public_html/FPGA/Virtex-6/Virtex-6_FPGA_OverView.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Virtex-6 FPGA OverView</title>
<!-- 2016-05-26 Thu 22:11 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Virtex-6 FPGA OverView</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">docs</a></li>
<li><a href="#sec-2">Virtex-6 FPGA ML605 Evaluation Kit - 13.4 docs</a></li>
<li><a href="#sec-3">Notes</a>
<ul>
<li><a href="#sec-3-1">UG360 Virtex-6 FPGA Configuration User Guide Notes</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">docs</h2>
<div class="outline-text-2" id="text-1">
<p>
This section provides references to documentation supporting Virtex-6 FPGAs, tools, and 
IP. For additional information, see www.xilinx.com/support/documentation/index.htm. 
</p>
<ol class="org-ol">
<li>UG534, ML605 Hardware User Guide
</li>
<li>UG535, ML605 Reference Design User Guide
</li>
<li>DS150, Virtex-6 Family Overview
</li>
<li>DS152, Virtex-6 FPGA Data Sheet: DC and Switching Characteristics
</li>
<li>UG360, Virtex-6 FPGA Configuration User Guide
</li>
<li>UG361, Virtex-6 FPGA SelectIO Resources User Guide
</li>
<li>UG362, Virtex-6 FPGA User Guide: Clocking Resources
</li>
<li>UG363, Virtex-6 FPGA Memory Resources User Guide
</li>
<li>UG364, Virtex-6 FPGA Configurable Logic Block User Guide
</li>
<li>UG365, Virtex-6 FPGA Packaging and Pinout Specifications
</li>
<li>UG366, Virtex-6 FPGA GTX Transceivers User Guide
</li>
<li>UG369, Virtex-6 FPGA DSP48E1 Slice User Guide 
</li>
<li>DS186, Virtex-6 FPGA Memory Interface Solutions Data Sheet
</li>
<li>UG370, Virtex-6 FPGA System Monitor User Guide
</li>
<li>DS643, Multi-Port Memory Controller (MPMC) (v5.02a) Data Sheet
</li>
<li>UG086, Memory Interface Solutions User Guide
</li>
<li>UG138, LogiCORE™ IP Tri-Mode Ethernet MAC v4.3 User Guide 
</li>
<li>UG517, LogiCORE™ IP Virtex-6 FPGA Integrated Block User Guide v1.3 for PCI Express
</li>
<li>DS715, Virtex-6 FPGA Integrated Block v1.3 for PCI Express Data Sheet
</li>
<li>Platform Studio EDK
</li>
</ol>
<p>
ML605 tutorials and design files are located at 
<a href="http://www.xilinx.com/products/boards/ml605/reference_designs.htm">http://www.xilinx.com/products/boards/ml605/reference_designs.htm</a>:
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Virtex-6 FPGA ML605 Evaluation Kit - 13.4 docs</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://www.xilinx.com/support/documentation/ml605_13-4.htm">http://www.xilinx.com/support/documentation/ml605_13-4.htm</a>
</p>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Notes</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">UG360 Virtex-6 FPGA Configuration User Guide Notes</h3>
<div class="outline-text-3" id="text-3-1">
</div><ul class="org-ul"><li><a id="sec-3-1-1" name="sec-3-1-1"></a>OverView<br  /><div class="outline-text-4" id="text-3-1-1">
<p>
These configuration pins serve as the interface
for a number of different configuration modes:
</p>

<ul class="org-ul">
<li>Master-Serial configuration mode
</li>
<li>Slave-Serial configuration mode
</li>
<li>Master SelectMAP (parallel) configuration mode (x8 and x16)
</li>
<li>Slave SelectMAP (parallel) configuration mode (x8, x16, and x32)
</li>
<li>JTAG/boundary-scan configuration mode
</li>
<li>Master Serial Peripheral Interface (SPI) flash configuration mode
</li>
<li>Master Byte Peripheral Interface Up or Down (BPI-Up or BPI-Down) flash
configuration mode (x8 and x16 only)
</li>
</ul>

<p>
The terms Master and Slave refer to the direction of the configuration
clock (CCLK):
</p>
<ul class="org-ul">
<li>In Master configuration modes, the Virtex-6 device drives CCLK from an internal
oscillator. To select the desired frequency, BitGen -g ConfigRate option is used. The
BitGen section of UG628, Command Line Tools User Guide provides more
information.
</li>
<li>In Slave configuration modes, CCLK is an input.
</li>
</ul>
</div>
</li>
<li><a id="sec-3-1-2" name="sec-3-1-2"></a>Chapter 2<br  /><div class="outline-text-4" id="text-3-1-2">
<p>
Virtex-6 FPGA Configuration Modes
</p>

<p class="verse">
Configuration Mode    M[2:0]    Bus Width  CCLK Direction<br  />
Master Serial         000       1          Output<br  />
Master SPI            001       1          Output<br  />
Master BPI-Up         010       8, 16      Output<br  />
Master BPI-Down       011       8, 16      Output<br  />
Master SelectMAP      100       8, 16      Output<br  />
JTAG                  101       1          Input (TCK)<br  />
Slave SelectMAP       110       8, 16, 32  Input<br  />
Slave Serial          111       1          Input<br  />
</p>
</div>
<ul class="org-ul"><li><a id="sec-3-1-2-1" name="sec-3-1-2-1"></a>Master BPI Configuration Interface<br  /><div class="outline-text-5" id="text-3-1-2-1">
<p>
From the Master Byte-wide Peripheral Interface (BPI), the Virtex-6 FPGA can configure
itself in BPI-Up (M[2:0]=010) or BPI-Down (M[2:0] = 011) mode. 
</p>

<p>
In BPI modes, the CCLK output is not connected to the BPI flash device. However, the
FPGA outputs an address after the rising edge of CCLK, and the data is still sampled on
the next rising edge of CCLK. The timing parameters related to BPI use CCLK as a
reference. 
</p>

<p>
In the BPI-Up mode, the address starts at 0 and increments by 1 until the DONE pin is
asserted.
</p>

<p>
In the BPI-Down mode, the address start at 26’h3FFFFFF and decrements by 1 until the
DONE pin is asserted.
</p>

<p>
The iMPACT programming software provides the ability to program Top boot parallel
NOR flash using an indirect programming method. “Introduction to Indirect Programming – SPI or BPI Flash Memory.” For software flow
details, see XAPP973, <b>Indirect Programming of BPI PROMs with Virtex-5
FPGAs</b>.
</p>
</div>
</li></ul>
</li></ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2016-05-26 Thu 22:11</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
